library/utf8/tests/data/bench/strlen_native_20061001.txt
This is ApacheBench, Version 2.0.41-dev <$Revision: 1.1 $> apache-2.0
Copyright (c) 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Copyright (c) 1998-2002 The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Apache/2.0.55
Server Hostname:        localhost
Server Port:            80

Document Path:          /~harryf/utf8/tests/bench/strlen.php?engine=native
Document Length:        6 bytes

Concurrency Level:      1
Time taken for tests:   8.210329 seconds
Complete requests:      1000
Failed requests:        0
Write errors:           0
Total transferred:      207000 bytes
HTML transferred:       6000 bytes
Requests per second:    121.80 [#/sec] (mean)
Time per request:       8.210 [ms] (mean)
Time per request:       8.210 [ms] (mean, across all concurrent requests)
Transfer rate:          24.60 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       4
Processing:     4    7   5.5      4      57
Waiting:        0    0   0.8      0      23
Total:          4    7   5.5      4      57

Percentage of the requests served within a certain time (ms)
  50%      4
  66%     12
  75%     12
  80%     13
  90%     14
  95%     17
  98%     17
  99%     25
 100%     57 (longest request)