library/utf8/tests/data/bench/strpos_mbstring_20061001.txt
This is ApacheBench, Version 2.0.41-dev <$Revision: 1.1 $> apache-2.0
Copyright (c) 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Copyright (c) 1998-2002 The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Apache/2.0.55
Server Hostname:        localhost
Server Port:            80

Document Path:          /~harryf/utf8/tests/bench/strpos.php?engine=mbstring
Document Length:        95 bytes

Concurrency Level:      1
Time taken for tests:   5.337757 seconds
Complete requests:      1000
Failed requests:        0
Write errors:           0
Total transferred:      297000 bytes
HTML transferred:       95000 bytes
Requests per second:    187.34 [#/sec] (mean)
Time per request:       5.338 [ms] (mean)
Time per request:       5.338 [ms] (mean, across all concurrent requests)
Transfer rate:          54.33 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.0      0      31
Processing:     1    4   4.4      5      59
Waiting:        0    0   0.1      0       4
Total:          1    4   4.5      5      59

Percentage of the requests served within a certain time (ms)
  50%      5
  66%      6
  75%      6
  80%      6
  90%      7
  95%      9
  98%     13
  99%     22
 100%     59 (longest request)